Revit 2027 API
ScheduleDefinition.ShowGridLines Property
 Indicates if the schedule grid lines will be visible on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGridLines { get; set; }
Public Property ShowGridLines As Boolean
	Get
	Set
public:
property bool ShowGridLines {
	bool get ();
	void set (bool value);
}
member ShowGridLines : bool with get, set
Property Value
Boolean
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace